In [21]:
try:
    file = open('filehandlingfolder/data.csv','x')
    file.close()
except:
    print("The file is already there!")

The file is already there!

In [1]:
file = open('filehandlingfolder/data.csv','r')
x = file.read()
print(x)
file.close()

"sn,name,age,address,phone"
"1,Ram,23,Kathmandu,9808778765"
"2,Shyam,45,Bhaktapuer,9808667654"
"3,Sabin,23,Lalitpur,9808778765"
"					"

In [3]:
import pandas as pd
df = pd.read_csv('filehandlingfolder/data.csv')[:-1]
df

          sn,name,age,address,phone
0     1,Ram,23,Kathmandu,9808778765
1  2,Shyam,45,Bhaktapuer,9808667654
2    3,Sabin,23,Lalitpur,9808778765

In [4]:
import pandas as pd
df = pd.read_csv('filehandlingfolder/data.csv',nrows = 3)
df

          sn,name,age,address,phone
0     1,Ram,23,Kathmandu,9808778765
1  2,Shyam,45,Bhaktapuer,9808667654
2    3,Sabin,23,Lalitpur,9808778765

In [6]:
import pandas as pd
df = pd.read_csv('filehandlingfolder/data.csv')
# df.head(7)
df.tail(2)

        sn,name,age,address,phone
2  3,Sabin,23,Lalitpur,9808778765
3                      \t\t\t\t\t

In [8]:
import pandas as pd
df = pd.read_csv('data.csv',index_col='sn')
df.head(7)
# df.tail()

ValueError: Index sn invalid

In [12]:
# loc
# iloc

In [13]:
import pandas as pd
df = pd.read_csv('data.csv',index_col='sn')
df.iloc[1:5]

     name  age     address       phone
sn
2   Shyam   45  Bhaktapuer  9808667654
3   Sabin   23    Lalitpur  9808778765
4    Hari   45       Jhapa  9808778765
5     Ram   65     Chitwan  9808778765

In [14]:
import pandas as pd
df = pd.read_csv('data.csv',index_col='sn')
df.iloc[1:5,0:2]

     name  age
sn
2   Shyam   45
3   Sabin   23
4    Hari   45
5     Ram   65

In [16]:
import pandas as pd
df = pd.read_csv('data.csv',index_col='sn')
df.loc[2:5]

     name  age     address       phone
sn
2   Shyam   45  Bhaktapuer  9808667654
3   Sabin   23    Lalitpur  9808778765
4    Hari   45       Jhapa  9808778765
5     Ram   65     Chitwan  9808778765

In [19]:
import pandas as pd
df = pd.read_csv('data.csv',index_col='name')
df.loc['Shyam':'Sabina']

        sn  age     address       phone
name
Shyam    2   45  Bhaktapuer  9808667654
Sabin    3   23    Lalitpur  9808778765
Hari     4   45       Jhapa  9808778765
Ram      5   65     Chitwan  9808778765
Sabina   6   12   Kathmandu  9808778765

In [21]:
import pandas as pd
df = pd.read_csv('data.csv',index_col='sn',usecols = ['sn','name','address'])
df

      name     address
sn
1      Ram   Kathmandu
2    Shyam  Bhaktapuer
3    Sabin    Lalitpur
4     Hari       Jhapa
5      Ram     Chitwan
6   Sabina   Kathmandu

In [26]:
import pandas as pd
df = pd.read_csv('data.csv',index_col='sn')
list(df['name'])

['Ram', 'Shyam', 'Sabin', 'Hari', 'Ram', 'Sabina']

In [29]:
import pandas as pd
df = pd.read_csv('data.csv',index_col='sn')
df[df['name'] == 'Ram']

   name  age    address       phone
sn
1   Ram   23  Kathmandu  9808778765
5   Ram   65    Chitwan  9808778765

In [32]:
import pandas as pd
df = pd.read_csv('data.csv',index_col='sn')
df[df['age'] > 20]

     name  age     address       phone
sn
1     Ram   23   Kathmandu  9808778765
2   Shyam   45  Bhaktapuer  9808667654
3   Sabin   23    Lalitpur  9808778765
4    Hari   45       Jhapa  9808778765
5     Ram   65     Chitwan  9808778765

In [33]:
import pandas as pd
df = pd.read_csv('data.csv',index_col='sn')
df[(df['age'] > 20) & (df['address'] == 'Kathmandu')]

   name  age    address       phone
sn
1   Ram   23  Kathmandu  9808778765

In [34]:
import pandas as pd
df = pd.read_csv('data.csv',index_col='sn')
data = df[df['age'] > 20]
data.to_csv('new_data.csv')

In [35]:
data

     name  age     address       phone
sn
1     Ram   23   Kathmandu  9808778765
2   Shyam   45  Bhaktapuer  9808667654
3   Sabin   23    Lalitpur  9808778765
4    Hari   45       Jhapa  9808778765
5     Ram   65     Chitwan  9808778765

In [36]:
import pandas as pd
df = pd.read_csv('data.csv',index_col='sn')
data = df[df['age'] > 20]
data.to_json('new_data.json')

In [3]:
import pandas as pd
info = {'name':[],'age':[],'address':[],'phone':[]}
n = int(input("Enter n = "))
for i in range(n):
    name = input("Enter name = ")
    age = input("Enter age = ")
    address = input("Enter address = ")
    phone = input("Enter phone = ")
    info['name'].append(name)
    info['age'].append(age)
    info['address'].append(address)
    info['phone'].append(phone)


#Convert to dataframe
df = pd.DataFrame(info)
df.to_csv('info.csv')
df

Enter n = 2
Enter name = Ram
Enter age = 78
Enter address = Kathmandu
Enter phone = 9808778765
Enter name = Shyan
Enter age = 67
Enter address = Bara
Enter phone = 9808778765

    name age    address       phone
0    Ram  78  Kathmandu  9808778765
1  Shyan  67       Bara  9808778765

In [7]:
import csv
l = [2,'Sabin',45,'Bara','9808778765']
file = open('info.csv','a')
x = csv.writer(file)
x.writerow(l)
file.close()

In [8]:
import pandas as pd
df = pd.read_csv('info.csv')
df

   sn   name  age    address       phone
0   0    Ram   78  Kathmandu  9808778765
1   1  Shyan   67       Bara  9808778765
2   2  Sabin   45       Bara  9808778765

In [12]:
import csv
import pandas as pd
l = [['sn','name','age','address','phone'],
     [1,'Ram', 45, 'Kathmandu',9808778765], 
     [2,'Shyam', 78, 'Bhaktapur',9808778765], 
     [3,'Hari', 45, 'Jhapa',9808778765]]

file = open('info1.csv','w')
x = csv.writer(file)
x.writerows(l)
file.close()

df = pd.read_csv('info1.csv')
df

   sn   name  age    address       phone
0   1    Ram   45  Kathmandu  9808778765
1   2  Shyam   78  Bhaktapur  9808778765
2   3   Hari   45      Jhapa  9808778765

In [17]:
import csv
final_data = []
file = open('info1.csv')
reader = csv.DictReader(file)
for row in reader:
    final_data.append(row)
    
final_data

[{'sn': '1',
  'name': 'Ram',
  'age': '45',
  'address': 'Kathmandu',
  'phone': '9808778765'},
 {'sn': '2',
  'name': 'Shyam',
  'age': '78',
  'address': 'Bhaktapur',
  'phone': '9808778765'},
 {'sn': '3',
  'name': 'Hari',
  'age': '45',
  'address': 'Jhapa',
  'phone': '9808778765'}]

In [20]:
import csv
csv_columns = ['sn','name','age','address','phone']
# dict = [
#     {'Name':'Aayush','Age':23,'Address':'Katmandu'},
#     {'Name':'Shyam','Age':33,'Address':'Patan'}
# ]
dicts = final_data

file = open("data1.csv", 'w')
writer = csv.DictWriter(file, fieldnames=csv_columns)
writer.writeheader()
writer.writerows(dicts)
file.close()

In [27]:
import pandas as pd
df = pd.read_csv('data1.csv',index_col ='sn')
df

     name  age    address       phone
sn
1     Ram   45  Kathmandu  9808778765
2   Shyam   78  Bhaktapur  9808778765
3    Hari   45      Jhapa  9808778765

In [26]:
import pandas as pd
df = pd.read_csv('data1.csv',index_col ='sn')
df = df.drop([2,3],axis=0)
df

   name  age    address       phone
sn
1   Ram   45  Kathmandu  9808778765

In [31]:
import pandas as pd
df = pd.read_csv('data1.csv',index_col ='name')
df = df.drop(['Ram','Shyam'],axis=0)
df

      sn  age address       phone
name
Hari   3   45   Jhapa  9808778765

In [29]:
import pandas as pd
df = pd.read_csv('data1.csv')
df = df.drop(['address','phone'],axis=1)
df

   sn   name  age
0   1    Ram   45
1   2  Shyam   78
2   3   Hari   45